NationsHuanghanbin/sdk-bsp-n32g45xvl-stb/project_0/Libraries/n32_drivers/drv_can.c
    return RT_EOK;
}

static rt_err_t bxcan_init(struct rt_can_device *can, struct can_configure *cfg)
{
    struct n32_can *drv_can;
    rt_uint32_t baud_index;

    RT_ASSERT(can);
    RT_ASSERT(cfg);
    drv_can = (struct n32_can *)can->parent.user_data;
    RT_ASSERT(drv_can);

    /* Struct init*/
    CAN_InitStruct(&(drv_can->can_init));

    drv_can->can_init.TTCM  = DISABLE;
    drv_can->can_init.ABOM  = DISABLE;
    drv_can->can_init.AWKUM = DISABLE;
    drv_can->can_init.NART  = DISABLE;
    drv_can->can_init.RFLM  = DISABLE;
    drv_can->can_init.TXFP  = ENABLE;

    // Mode
    switch (cfg->mode)
    {
        case RT_CAN_MODE_NORMAL:
                drv_can->can_init.OperatingMode = CAN_Normal_Mode;
                break;
        
        case RT_CAN_MODE_LISEN:
                drv_can->can_init.OperatingMode = CAN_Silent_Mode;
                break;
        
        case RT_CAN_MODE_LOOPBACK:
                drv_can->can_init.OperatingMode = CAN_LoopBack_Mode;
                break;
        
        case RT_CAN_MODE_LOOPBACKANLISEN:
                drv_can->can_init.OperatingMode = CAN_Silent_LoopBack_Mode;
                break;
        
        default:
                drv_can->can_init.OperatingMode = CAN_Normal_Mode;
                break;
    }

    // Baud
    baud_index                          = get_can_baud_index(cfg->baud_rate);
    drv_can->can_init.RSJW              = can_baud_rate_tab[baud_index].RSJW;
    drv_can->can_init.TBS1              = can_baud_rate_tab[baud_index].TBS1;
    drv_can->can_init.TBS2              = can_baud_rate_tab[baud_index].TBS2;
    drv_can->can_init.BaudRatePrescaler = can_baud_rate_tab[baud_index].PRESCALE;

    /* init can */
    if (CAN_Init(drv_can->CANx, &(drv_can->can_init)) != CAN_InitSTS_Success)
    {
        rt_kprintf("Can init error\n");
        return -RT_ERROR;
    }
		
    /* default filter config */
    setfilter(drv_can);
		
    return RT_EOK;
}

static rt_err_t configure(struct rt_can_device *can, struct can_configure *cfg)
{
    struct n32_can *drv_can;
    CAN_Module *pbxcan;

    drv_can = (struct n32_can *)can->parent.user_data;
    pbxcan  = drv_can->CANx;

#if defined(SOC_N32G45X) || defined(SOC_N32WB452)
    if (pbxcan == CAN1)
    {
#ifdef BSP_USING_CAN1
        bxcan1_hw_init();
        bxcan_init(&drv_can->device, &drv_can->device.config);
#endif
    }
    else  if (pbxcan == CAN2)
    {
#ifdef BSP_USING_CAN2
        bxcan2_hw_init();
        bxcan_init(&drv_can->device, &drv_can->device.config);
#endif
    }
#endif

#if defined(SOC_N32L43X) || defined(SOC_N32L40X) || defined(SOC_N32G43X)
    if (pbxcan == CAN)
    {
#ifdef BSP_USING_CAN
    bxcan_hw_init();
    bxcan_init(&drv_can->device, &drv_can->device.config);
#endif
    }
#endif
    return RT_EOK;
}

/**
 * @brief  Configures the NVIC for CAN.
 */
void CAN_NVIC_Config(IRQn_Type IRQn, uint8_t PreemptionPriority, uint8_t SubPriority,FunctionalState cmd)
{
    NVIC_InitType NVIC_InitStructure;

    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_1);

    NVIC_InitStructure.NVIC_IRQChannel    = IRQn;
    NVIC_InitStructure.NVIC_IRQChannelCmd = cmd;
    if(cmd)
    {
        NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = PreemptionPriority;
        NVIC_InitStructure.NVIC_IRQChannelSubPriority        = SubPriority;
    }
    NVIC_Init(&NVIC_InitStructure);
}

static rt_err_t control(struct rt_can_device *can, int cmd, void *arg)
{
    rt_uint32_t argval;
    struct n32_can *drv_can;
    struct rt_can_filter_config *filter_cfg;

    RT_ASSERT(can != RT_NULL);
    drv_can = (struct n32_can *)can->parent.user_data;
    RT_ASSERT(drv_can != RT_NULL);

    switch(cmd)
    {
        case RT_DEVICE_CTRL_CLR_INT:
            argval = (rt_uint32_t) arg;
        if (argval == RT_DEVICE_FLAG_INT_RX)
        {
#if defined(SOC_N32G45X) || defined(SOC_N32WB452)
            if(CAN1 == drv_can->CANx)
            {
                NVIC_DisableIRQ(USB_LP_CAN1_RX0_IRQn);
                NVIC_DisableIRQ(CAN1_RX1_IRQn);
            }
#ifdef CAN2
            if(CAN2 == drv_can->CANx)
            {
                NVIC_DisableIRQ(CAN2_RX0_IRQn);
                NVIC_DisableIRQ(CAN2_RX1_IRQn);
            }
#endif
#elif defined(SOC_N32L43X) || defined(SOC_N32L40X) || defined(SOC_N32G43X)
					 if(CAN == drv_can->CANx)
					 {
						   NVIC_DisableIRQ(CAN_RX0_IRQn);
						   NVIC_DisableIRQ(CAN_RX1_IRQn);
					 }
#endif
            CAN_INTConfig(drv_can->CANx, CAN_INT_FMP0, DISABLE); /* DATFIFO 0 message pending Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_FF0, DISABLE);  /* DATFIFO 0 full Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_FOV0, DISABLE); /* DATFIFO 0 overrun Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_FMP1, DISABLE); /* DATFIFO 1 message pending Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_FF1, DISABLE);  /* DATFIFO 1 full Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_FOV1, DISABLE); /* DATFIFO 1 overrun Interrupt */
        }
        else if(argval == RT_DEVICE_FLAG_INT_TX)
        {
#if defined(SOC_N32G45X) || defined(SOC_N32WB452)
            if (CAN1 == drv_can->CANx)
            {
                NVIC_DisableIRQ(USB_HP_CAN1_TX_IRQn);
            }
#ifdef CAN2
            if (CAN2 == drv_can->CANx)
            {
                NVIC_DisableIRQ(CAN2_TX_IRQn);
            }
#endif
#elif defined(SOC_N32L43X) || defined(SOC_N32L40X) || defined(SOC_N32G43X)
            if(CAN == drv_can->CANx)
            {
                  NVIC_DisableIRQ(CAN_TX_IRQn);
            }
#endif
            CAN_INTConfig(drv_can->CANx, CAN_INT_TME, DISABLE); /* Transmit mailbox empty Interrupt */
        }
        else if (argval == RT_DEVICE_CAN_INT_ERR)
        {
#if defined(SOC_N32G45X) || defined(SOC_N32WB452)
            if (CAN1 == drv_can->CANx)
            {
                NVIC_DisableIRQ(CAN1_SCE_IRQn);
            }
#ifdef CAN2
            if (CAN2 == drv_can->CANx)
            {
                NVIC_DisableIRQ(CAN2_SCE_IRQn);
            }
#endif
#elif defined(SOC_N32L43X) || defined(SOC_N32L40X) || defined(SOC_N32G43X)
            if (CAN == drv_can->CANx)
            {
                NVIC_DisableIRQ(CAN_SCE_IRQn);
            }
#endif
            CAN_INTConfig(drv_can->CANx, CAN_INT_EWG, DISABLE); /* Error warning Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_EPV, DISABLE); /* Error passive Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_BOF, DISABLE); /* Bus-off Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_LEC, DISABLE); /* Last error code Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_ERR, DISABLE); /* Error Interrupt */
        }
        break;
    
        case RT_DEVICE_CTRL_SET_INT:
        argval = (rt_uint32_t) arg;
        if(argval == RT_DEVICE_FLAG_INT_RX)
        {
            CAN_INTConfig(drv_can->CANx, CAN_INT_FMP0, ENABLE); /* DATFIFO 0 message pending Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_FF0, ENABLE);  /* DATFIFO 0 full Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_FOV0, ENABLE); /* DATFIFO 0 overrun Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_FMP1, ENABLE); /* DATFIFO 1 message pending Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_FF1, ENABLE);  /* DATFIFO 1 full Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_FOV1, ENABLE); /* DATFIFO 1 overrun Interrupt */

#if defined(SOC_N32G45X) || defined(SOC_N32WB452)
            if (CAN1 == drv_can->CANx)
            {
                CAN_NVIC_Config(USB_LP_CAN1_RX0_IRQn, 1, 0, ENABLE);
                CAN_NVIC_Config(CAN1_RX1_IRQn, 1, 0, ENABLE);
            }
#ifdef CAN2
            if (CAN2 == drv_can->CANx)
            {
                CAN_NVIC_Config(CAN2_RX0_IRQn, 1, 0, ENABLE);
                CAN_NVIC_Config(CAN2_RX1_IRQn, 1, 0, ENABLE);
            }
#endif
#elif defined(SOC_N32L43X) || defined(SOC_N32L40X) || defined(SOC_N32G43X)
            if (CAN == drv_can->CANx)
            {
                CAN_NVIC_Config(CAN_RX0_IRQn, 1, 0, ENABLE);
                CAN_NVIC_Config(CAN_RX1_IRQn, 1, 0, ENABLE);
            }
#endif
        }
        else if (argval == RT_DEVICE_FLAG_INT_TX)
        {
            CAN_INTConfig(drv_can->CANx, CAN_INT_TME, ENABLE); /* Transmit mailbox empty Interrupt */

#if defined(SOC_N32G45X) || defined(SOC_N32WB452)
            if (CAN1 == drv_can->CANx)
            {
                CAN_NVIC_Config(USB_HP_CAN1_TX_IRQn, 1, 0, ENABLE);
            }
#ifdef CAN2
            if (CAN2 == drv_can->CANx)
            {
                CAN_NVIC_Config(CAN2_TX_IRQn, 1, 0, ENABLE);
            }
#endif
#elif defined(SOC_N32L43X) || defined(SOC_N32L40X) || defined(SOC_N32G43X)
            if (CAN == drv_can->CANx)
            {
                CAN_NVIC_Config(CAN_TX_IRQn, 1, 0, ENABLE);
            }
#endif
        }
        else if (argval == RT_DEVICE_CAN_INT_ERR)
        {
            CAN_INTConfig(drv_can->CANx, CAN_INT_EWG, ENABLE); /* Error warning Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_EPV, ENABLE); /* Error passive Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_BOF, ENABLE); /* Bus-off Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_LEC, ENABLE); /* Last error code Interrupt */
            CAN_INTConfig(drv_can->CANx, CAN_INT_ERR, ENABLE); /* Error Interrupt */

#if defined(SOC_N32G45X) || defined(SOC_N32WB452)
            if (CAN1 == drv_can->CANx)
            {
                CAN_NVIC_Config(CAN1_SCE_IRQn, 1, 0, ENABLE);
            }
#ifdef CAN2
            if (CAN2 == drv_can->CANx)
            {
                CAN_NVIC_Config(CAN2_SCE_IRQn, 1, 0, ENABLE);
            }
#endif
#elif defined(SOC_N32L43X) || defined(SOC_N32L40X) || defined(SOC_N32G43X)
            if (CAN == drv_can->CANx)
            {
                CAN_NVIC_Config(CAN_SCE_IRQn, 1, 0, ENABLE);
            }
#endif
        }
        break;
        
        case RT_CAN_CMD_SET_FILTER:
        {
            rt_uint32_t id_h        = 0;
        rt_uint32_t id_l        = 0;
        rt_uint32_t mask_h      = 0;
        rt_uint32_t mask_l      = 0;
        rt_uint32_t mask_l_tail = 0;  //CAN_FxR2 bit [2:0]
				
