NationsHuanghanbin/sdk-bsp-n32g45xvl-stb/project_0/Libraries/n32_drivers/drv_can.c
        if (RT_NULL == arg)
        {
            /* Default filter config */
            setfilter(drv_can);
        }
        else
        {
            filter_cfg = (struct rt_can_filter_config *)arg;
            /* Get default filter */
            for(int i = 0; i < filter_cfg->count; i++)
            {
                if(filter_cfg->items[i].hdr == -1)
                {
                        /* Can banks 0~13 */
                        drv_can->FilterConfig.Filter_Num = i;
                }
                else
                {
                        /* Use user-defined filter bank settings */
                        drv_can->FilterConfig.Filter_Num = filter_cfg->items[i].hdr;
                }
                
                /* Filter groups work in identifier masking bit mode */
                if(filter_cfg->items[i].mode == CAN_Filter_IdMaskMode)
                {
                    /* make sure the IDE and RTR work */
                     mask_l_tail = 0x06;
                     drv_can->FilterConfig.Filter_Mode = CAN_Filter_IdMaskMode;
                }
                /* Filter groups work in identifier list mode */
                else if(filter_cfg->items[i].mode == CAN_Filter_IdListMode)
                {
                     mask_l_tail = (filter_cfg->items[i].ide << 2) | (filter_cfg->items[i].rtr << 1);
                     drv_can->FilterConfig.Filter_Mode = CAN_Filter_IdListMode;
                }
                
                if(filter_cfg->items[i].ide == RT_CAN_STDID)
                {
                    id_h   = ((filter_cfg->items[i].id << 18) >> 13) & 0xFFFF;
                    id_l   = ((filter_cfg->items[i].id << 18) |
                              (filter_cfg->items[i].ide << 2) |
                              (filter_cfg->items[i].rtr << 1)) & 0xFFFF;
                    mask_h = ((filter_cfg->items[i].mask << 21) >> 16) & 0xFFFF;
                    mask_l = ((filter_cfg->items[i].mask << 21) | mask_l_tail) & 0xFFFF;
                }
                else if(filter_cfg->items[i].ide == RT_CAN_EXTID)
                {
                    id_h   = (filter_cfg->items[i].id >> 13) & 0xFFFF;
                    id_l   = ((filter_cfg->items[i].id << 3)  |
                                (filter_cfg->items[i].ide << 2) |
                                (filter_cfg->items[i].rtr << 1)) & 0xFFFF;
                    mask_h = ((filter_cfg->items[i].mask << 3) >> 16) & 0xFFFF;
                    mask_l = ((filter_cfg->items[i].mask << 3) | mask_l_tail) & 0xFFFF;
                }
                        
                drv_can->FilterConfig.Filter_HighId         = id_h;
                drv_can->FilterConfig.Filter_LowId          = id_l;
                drv_can->FilterConfig.FilterMask_HighId     = mask_h;
                drv_can->FilterConfig.FilterMask_LowId      = mask_l;
                drv_can->FilterConfig.Filter_FIFOAssignment = CAN_FIFO0;
                drv_can->FilterConfig.Filter_Scale          = CAN_Filter_32bitScale;
                drv_can->FilterConfig.Filter_Act            = ENABLE;

                /* Filter conf */
                setfilter(drv_can);
            }
        }
        break;
            }
            
      case RT_CAN_CMD_SET_MODE:
        argval = (rt_uint32_t) arg;
        if (argval != RT_CAN_MODE_NORMAL &&
            argval != RT_CAN_MODE_LISEN &&
            argval != RT_CAN_MODE_LOOPBACK &&
            argval != RT_CAN_MODE_LOOPBACKANLISEN)
        {
            return -RT_ERROR;
        }
        if (argval != drv_can->device.config.mode)
        {
            drv_can->device.config.mode = argval;
            return configure(&drv_can->device, &drv_can->device.config);
        }
        break;
				
      case RT_CAN_CMD_SET_BAUD:
        argval = (rt_uint32_t) arg;
        if (argval != CAN1MBaud &&
            argval != CAN800kBaud &&
            argval != CAN500kBaud &&
            argval != CAN250kBaud &&
            argval != CAN125kBaud &&
            argval != CAN100kBaud &&
            argval != CAN50kBaud  &&
            argval != CAN20kBaud  &&
            argval != CAN10kBaud)
        {
            return -RT_ERROR;
        }
        if (argval != drv_can->device.config.baud_rate)
        {
            drv_can->device.config.baud_rate = argval;
            return configure(&drv_can->device, &drv_can->device.config);
        }
        break;
				
      case RT_CAN_CMD_SET_PRIV:
        argval = (rt_uint32_t) arg;
        if (argval != RT_CAN_MODE_PRIV &&
            argval != RT_CAN_MODE_NOPRIV)
        {
            return -RT_ERROR;
        }
        if (argval != drv_can->device.config.privmode)
        {
            drv_can->device.config.privmode = argval;
            return configure(&drv_can->device, &drv_can->device.config);
        }
        break;
				
      case RT_CAN_CMD_GET_STATUS:
      {
        rt_uint32_t errtype;
        errtype = drv_can->CANx->ESTS;
        drv_can->device.status.rcverrcnt   = errtype >> 24;
        drv_can->device.status.snderrcnt   = (errtype >> 16 & 0xFF);
        drv_can->device.status.lasterrtype = errtype & 0x70;
        drv_can->device.status.errcode     = errtype & 0x07;

        rt_memcpy(arg, &drv_can->device.status, sizeof(drv_can->device.status));
      }
      break;
    }
  return RT_EOK;
}

/* CAN Mailbox Transmit Request */
#define TMIDxR_TXRQ ((uint32_t)0x00000001) 

static int can_sendmsg_rtmsg(CAN_Module *CANx, struct rt_can_msg *pmsg, uint32_t mailbox_index)
{
    CanTxMessage CAN_TxMessage = {0};
    CanTxMessage *TxMessage = &CAN_TxMessage;
		
    /* Check the parameters */
    assert_param(IS_CAN_ALL_PERIPH(CANx));

    if (RT_CAN_STDID == pmsg->ide)
    {
        TxMessage->IDE = CAN_Standard_Id;
        RT_ASSERT(IS_CAN_STDID(pmsg->id));
        TxMessage->StdId = pmsg->id;
    }
    else
    {
        TxMessage->IDE = CAN_Extended_Id;
        RT_ASSERT(IS_CAN_EXTID(pmsg->id));
        TxMessage->ExtId = pmsg->id;
    }

    if (RT_CAN_DTR == pmsg->rtr)
    {
        TxMessage->RTR = CAN_RTRQ_DATA;
    }
    else
    {
        TxMessage->RTR = CAN_RTRQ_REMOTE;
    }

    if (mailbox_index != CAN_TxSTS_NoMailBox)
    {
        /* Set up the Id */
        CANx->sTxMailBox[mailbox_index].TMI &= TMIDxR_TXRQ;
        if (TxMessage->IDE == CAN_Standard_Id)
        {
            assert_param(IS_CAN_STDID(TxMessage->StdId));
            CANx->sTxMailBox[mailbox_index].TMI |= ((TxMessage->StdId << 21) | TxMessage->RTR);
        }
        else
        {
            assert_param(IS_CAN_EXTID(TxMessage->ExtId));
            CANx->sTxMailBox[mailbox_index].TMI |= ((TxMessage->ExtId << 3) | TxMessage->IDE | TxMessage->RTR);
        }

        /* Set up the DLC */
        TxMessage->DLC = pmsg->len & 0x0FU;
        CANx->sTxMailBox[mailbox_index].TMDT &= (uint32_t)0xFFFFFFF0;
        CANx->sTxMailBox[mailbox_index].TMDT |= TxMessage->DLC;

        /* Set up the data field */
        CANx->sTxMailBox[mailbox_index].TMDH = (((uint32_t)pmsg->data[7] << 24) |
                                                ((uint32_t)pmsg->data[6] << 16) |
                                                ((uint32_t)pmsg->data[5] << 8)  |
                                                ((uint32_t)pmsg->data[4]));
        CANx->sTxMailBox[mailbox_index].TMDL = (((uint32_t)pmsg->data[3] << 24) |
                                                ((uint32_t)pmsg->data[2] << 16) |
                                                ((uint32_t)pmsg->data[1] << 8)  |
                                                ((uint32_t)pmsg->data[0]));
        /* Request transmission */
        CANx->sTxMailBox[mailbox_index].TMI |= TMIDxR_TXRQ;

