NationsHuanghanbin/sdk-bsp-n32g45xvl-stb/project_0/Libraries/n32_drivers/drv_can.c
        case CAN_FIFO1:
                /* save to user list */
                if (CAN_GetFlagSTS(drv_can->CANx, CAN_FLAG_FFMP1) && CAN_PendingMessage(drv_can->CANx, CAN_FIFO1))
                {
                        rt_hw_can_isr(can, RT_CAN_EVENT_RX_IND | fifo << 8);
                }
                /* Check FULL flag for FIFO1 */
                if (CAN_GetFlagSTS(drv_can->CANx, CAN_FLAG_FFULL1))
                {
                        /* Clear FIFO1 FULL Flag */
                        CAN_ClearFlag(drv_can->CANx, CAN_FLAG_FFULL1);
                }
                /* Check Overrun flag for FIFO1 */
                if (CAN_GetFlagSTS(drv_can->CANx, CAN_FLAG_FFOVR1))
                {
                        /* Clear FIFO1 Overrun Flag */
                        CAN_ClearFlag(drv_can->CANx, CAN_FLAG_FFOVR1);
                        rt_hw_can_isr(can, RT_CAN_EVENT_RXOF_IND | fifo << 8);
                }
                break;
    }
}

#ifdef BSP_USING_CAN1
void USB_HP_CAN1_TX_IRQHandler(void)
{
    rt_interrupt_enter();

    if (CAN_GetFlagSTS(drv_can1.CANx, CAN_FLAG_RQCPM0))
    {
        rt_hw_can_isr(&drv_can1.device, RT_CAN_EVENT_TX_DONE | (0x00 << 8));
        CAN_ClearFlag(drv_can1.CANx, CAN_FLAG_RQCPM0);
    }
    if (CAN_GetFlagSTS(drv_can1.CANx, CAN_FLAG_RQCPM1))
    {
        rt_hw_can_isr(&drv_can1.device, RT_CAN_EVENT_TX_DONE | (0x01 << 8));
        CAN_ClearFlag(drv_can1.CANx, CAN_FLAG_RQCPM1);
    }
    if (CAN_GetFlagSTS(drv_can1.CANx, CAN_FLAG_RQCPM2))
    {
        rt_hw_can_isr(&drv_can1.device, RT_CAN_EVENT_TX_DONE | (0x02 << 8));
        CAN_ClearFlag(drv_can1.CANx, CAN_FLAG_RQCPM2);
    }
    rt_interrupt_leave();
}

void USB_LP_CAN1_RX0_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    can_rx_isr(&drv_can1.device, CAN_FIFO0);

    /* leave interrupt */
    rt_interrupt_leave();
}

void CAN1_RX1_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    can_rx_isr(&drv_can1.device, CAN_FIFO1);
    
    /* leave interrupt */
    rt_interrupt_leave();
}

void CAN1_SCE_IRQHandler(void)
{
    uint32_t errtype;
    rt_interrupt_enter();

    if (CAN_GetIntStatus(drv_can1.CANx, CAN_INT_ERR))
    {
        errtype = drv_can1.CANx->ESTS;
        // ESTS -> LEC
        switch ((errtype & 0x70) >> 4)
        {
        case RT_CAN_BUS_BIT_PAD_ERR:
            break;
				
        case RT_CAN_BUS_FORMAT_ERR:
            drv_can1.device.status.formaterrcnt++;
            break;
				
        case RT_CAN_BUS_ACK_ERR: 
            drv_can1.device.status.ackerrcnt++;
            if (!READ_BIT(drv_can1.CANx->TSTS, CAN_TSTS_TXOKM0))
            {
                rt_hw_can_isr(&drv_can1.device, RT_CAN_EVENT_TX_FAIL | 0 << 8);
            }
            else if (!READ_BIT(drv_can1.CANx->TSTS, CAN_TSTS_TXOKM1))
            {
                rt_hw_can_isr(&drv_can1.device, RT_CAN_EVENT_TX_FAIL | 1 << 8);
            }
            else if (!READ_BIT(drv_can1.CANx->TSTS, CAN_TSTS_TXOKM2))
            {
                rt_hw_can_isr(&drv_can1.device, RT_CAN_EVENT_TX_FAIL | 2 << 8);
            }
            break;

        case RT_CAN_BUS_IMPLICIT_BIT_ERR:
        case RT_CAN_BUS_EXPLICIT_BIT_ERR:
            drv_can1.device.status.biterrcnt++;
            break;
				
        case RT_CAN_BUS_CRC_ERR:
            drv_can1.device.status.crcerrcnt++;
            break;
        }
				
        drv_can1.device.status.lasterrtype = errtype & 0x70;
        drv_can1.device.status.rcverrcnt   = errtype >> 24;
        drv_can1.device.status.snderrcnt   = (errtype >> 16 & 0xFF);
        drv_can1.device.status.errcode     = errtype & 0x07;

        CAN_ClearINTPendingBit(drv_can1.CANx, CAN_INT_ERR);
    }
    rt_interrupt_leave();
}
#endif /*BSP_USING_CAN1*/

#ifdef BSP_USING_CAN2
void CAN2_TX_IRQHandler(void)
{
    rt_interrupt_enter();
    if (CAN_GetFlagSTS(drv_can2.CANx, CAN_FLAG_RQCPM0))
    {
        CAN_ClearFlag(drv_can2.CANx, CAN_FLAG_RQCPM0);
        rt_hw_can_isr(&drv_can2.device, RT_CAN_EVENT_TX_DONE | (0x00 << 8));
    }
    if (CAN_GetFlagSTS(drv_can2.CANx, CAN_FLAG_RQCPM1))
    {
        CAN_ClearFlag(drv_can2.CANx, CAN_FLAG_RQCPM1);
        rt_hw_can_isr(&drv_can2.device, RT_CAN_EVENT_TX_DONE | (0x01 << 8));
    }
    if (CAN_GetFlagSTS(drv_can2.CANx, CAN_FLAG_RQCPM2))
    {
        CAN_ClearFlag(drv_can2.CANx, CAN_FLAG_RQCPM2);
        rt_hw_can_isr(&drv_can2.device, RT_CAN_EVENT_TX_DONE | (0x02 << 8));
    }
    rt_interrupt_leave();
}

void CAN2_RX0_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    can_rx_isr(&drv_can2.device, CAN_FIFO0);

    /* leave interrupt */
    rt_interrupt_leave();
}

void CAN2_RX1_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    can_rx_isr(&drv_can2.device, CAN_FIFO1);
		
    /* leave interrupt */
    rt_interrupt_leave();
}

void CAN2_SCE_IRQHandler(void)
{
    uint32_t errtype;
    rt_interrupt_enter();

    if (CAN_GetIntStatus(drv_can2.CANx, CAN_INT_ERR))
    {
        errtype = drv_can2.CANx->ESTS;
        // ESTS -> LEC
        switch ((errtype & 0x70) >> 4)
        {
            case RT_CAN_BUS_BIT_PAD_ERR:
                    break;
            
            case RT_CAN_BUS_FORMAT_ERR:
                    drv_can2.device.status.formaterrcnt++;
                    break;
            
            case RT_CAN_BUS_ACK_ERR: 
                    drv_can2.device.status.ackerrcnt++;
                    if (!READ_BIT(drv_can2.CANx->TSTS, CAN_TSTS_TXOKM0))
                    {
                        rt_hw_can_isr(&drv_can2.device, RT_CAN_EVENT_TX_FAIL | 0 << 8);
                    }
                    else if (!READ_BIT(drv_can2.CANx->TSTS, CAN_TSTS_TXOKM1))
                    {
                        rt_hw_can_isr(&drv_can2.device, RT_CAN_EVENT_TX_FAIL | 1 << 8);
                    }
                    else if (!READ_BIT(drv_can2.CANx->TSTS, CAN_TSTS_TXOKM2))
                    {
                        rt_hw_can_isr(&drv_can2.device, RT_CAN_EVENT_TX_FAIL | 2 << 8);
                    }
                    break;
                    
            case RT_CAN_BUS_IMPLICIT_BIT_ERR:
            case RT_CAN_BUS_EXPLICIT_BIT_ERR:
                    drv_can2.device.status.biterrcnt++;
                    break;
            
