NationsHuanghanbin/sdk-bsp-n32g45xvl-stb/project_0/Libraries/n32_drivers/drv_can.c
            case RT_CAN_BUS_CRC_ERR:
                    drv_can2.device.status.crcerrcnt++;
                    break;
        }

        drv_can2.device.status.lasterrtype = errtype & 0x70;
        drv_can2.device.status.rcverrcnt   = errtype >> 24;
        drv_can2.device.status.snderrcnt   = (errtype >> 16 & 0xFF);
        drv_can2.device.status.errcode     = errtype & 0x07;

        CAN_ClearINTPendingBit(drv_can2.CANx, CAN_INT_ERR);
    }
    rt_interrupt_leave();
}
#endif /*BSP_USING_CAN2*/

#if defined(SOC_N32L43X) || defined(SOC_N32L40X) || defined(SOC_N32G43X)
#ifdef BSP_USING_CAN
void CAN_TX_IRQHandler(void)
{
    rt_interrupt_enter();
    if (CAN_GetFlagSTS(drv_can.CANx, CAN_FLAG_RQCPM0))
    {
        CAN_ClearFlag(drv_can.CANx, CAN_FLAG_RQCPM0);
        rt_hw_can_isr(&drv_can.device, RT_CAN_EVENT_TX_DONE | (0x00 << 8));
    }
    if (CAN_GetFlagSTS(drv_can.CANx, CAN_FLAG_RQCPM1))
    {
        CAN_ClearFlag(drv_can.CANx, CAN_FLAG_RQCPM1);
        rt_hw_can_isr(&drv_can.device, RT_CAN_EVENT_TX_DONE | (0x01 << 8));
    }
    if (CAN_GetFlagSTS(drv_can.CANx, CAN_FLAG_RQCPM2))
    {
        CAN_ClearFlag(drv_can.CANx, CAN_FLAG_RQCPM2);
        rt_hw_can_isr(&drv_can.device, RT_CAN_EVENT_TX_DONE | (0x02 << 8));
    }
    rt_interrupt_leave();
}

void CAN_RX0_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    can_rx_isr(&drv_can.device, CAN_FIFO0);

    /* leave interrupt */
    rt_interrupt_leave();
}

void CAN_RX1_IRQHandler(void)
{
    /* enter interrupt */
    rt_interrupt_enter();

    can_rx_isr(&drv_can.device, CAN_FIFO1);
		
    /* leave interrupt */
    rt_interrupt_leave();
}

void CAN_SCE_IRQHandler(void)
{
    uint32_t errtype;
    rt_interrupt_enter();

    if (CAN_GetIntStatus(drv_can.CANx, CAN_INT_ERR))
    {
        errtype = drv_can.CANx->ESTS;
        // ESTS -> LEC
        switch ((errtype & 0x70) >> 4)
        {
            case RT_CAN_BUS_BIT_PAD_ERR:
                    break;
            
            case RT_CAN_BUS_FORMAT_ERR:
                    drv_can.device.status.formaterrcnt++;
                    break;
            
            case RT_CAN_BUS_ACK_ERR: 
                    drv_can.device.status.ackerrcnt++;
                    if (!READ_BIT(drv_can.CANx->TSTS, CAN_TSTS_TXOKM0))
                    {
                        rt_hw_can_isr(&drv_can.device, RT_CAN_EVENT_TX_FAIL | 0 << 8);
                    }
                    else if (!READ_BIT(drv_can.CANx->TSTS, CAN_TSTS_TXOKM1))
                    {
                        rt_hw_can_isr(&drv_can.device, RT_CAN_EVENT_TX_FAIL | 1 << 8);
                    }
                    else if (!READ_BIT(drv_can.CANx->TSTS, CAN_TSTS_TXOKM2))
                    {
                        rt_hw_can_isr(&drv_can.device, RT_CAN_EVENT_TX_FAIL | 2 << 8);
                    }
                    break;
                    
            case RT_CAN_BUS_IMPLICIT_BIT_ERR:
            case RT_CAN_BUS_EXPLICIT_BIT_ERR:
                    drv_can.device.status.biterrcnt++;
                    break;
            
            case RT_CAN_BUS_CRC_ERR:
                    drv_can.device.status.crcerrcnt++;
                    break;
        }

        drv_can.device.status.lasterrtype = errtype & 0x70;
        drv_can.device.status.rcverrcnt   = errtype >> 24;
        drv_can.device.status.snderrcnt   = (errtype >> 16 & 0xFF);
        drv_can.device.status.errcode     = errtype & 0x07;

        CAN_ClearINTPendingBit(drv_can.CANx, CAN_INT_ERR);
    }
    rt_interrupt_leave();
}
#endif /* BSP_USING_CAN */
#endif

int rt_hw_can_init(void)
{
    struct can_configure config = CANDEFAULTCONFIG;
    config.privmode = RT_CAN_MODE_NOPRIV;
    config.ticks = 50;
	
#ifdef RT_CAN_USING_HDR
    config.maxhdr = 14;
#endif
		
#ifdef BSP_USING_CAN1
    /* config default filter */
    drv_can1.FilterConfig.Filter_Num            = 0;
    drv_can1.FilterConfig.Filter_Mode           = CAN_Filter_IdMaskMode;
    drv_can1.FilterConfig.Filter_Scale          = CAN_Filter_32bitScale;
    drv_can1.FilterConfig.Filter_HighId         = 0x0000;
    drv_can1.FilterConfig.Filter_LowId          = 0x0000;
    drv_can1.FilterConfig.FilterMask_HighId     = 0;
    drv_can1.FilterConfig.FilterMask_LowId      = 0;
    drv_can1.FilterConfig.Filter_FIFOAssignment = CAN_FIFO0; // CAN_FIFO1 CAN_FIFO0
    drv_can1.FilterConfig.Filter_Act            = ENABLE;
	
    drv_can1.device.config = config;
    /* register CAN1 device */
    rt_hw_can_register(&drv_can1.device, drv_can1.name, &canops, &drv_can1);
#endif /* BSP_USING_CAN1 */

#ifdef BSP_USING_CAN2
    /* config default filter */
    drv_can2.FilterConfig.Filter_Num            = 0;
    drv_can2.FilterConfig.Filter_Mode           = CAN_Filter_IdMaskMode;
    drv_can2.FilterConfig.Filter_Scale          = CAN_Filter_32bitScale;
    drv_can2.FilterConfig.Filter_HighId         = 0x0000;
    drv_can2.FilterConfig.Filter_LowId          = 0x0000;
    drv_can2.FilterConfig.FilterMask_HighId     = 0;
    drv_can2.FilterConfig.FilterMask_LowId      = 0;
    drv_can2.FilterConfig.Filter_FIFOAssignment = CAN_FIFO0;
    drv_can2.FilterConfig.Filter_Act            = ENABLE;
		
    drv_can2.device.config = config;
    /* register CAN2 device */
    rt_hw_can_register(&drv_can2.device, drv_can2.name, &canops, &drv_can2);
#endif /* BSP_USING_CAN2 */

#if defined(SOC_N32L43X) || defined(SOC_N32L40X) || defined(SOC_N32G43X)
#ifdef BSP_USING_CAN
    /* config default filter */
    drv_can.FilterConfig.Filter_Num            = 0;
    drv_can.FilterConfig.Filter_Mode           = CAN_Filter_IdMaskMode;
    drv_can.FilterConfig.Filter_Scale          = CAN_Filter_32bitScale;
    drv_can.FilterConfig.Filter_HighId         = 0x0000;
    drv_can.FilterConfig.Filter_LowId          = 0x0000;
    drv_can.FilterConfig.FilterMask_HighId     = 0;
    drv_can.FilterConfig.FilterMask_LowId      = 0;
    drv_can.FilterConfig.Filter_FIFOAssignment = CAN_FIFO0;
    drv_can.FilterConfig.Filter_Act            = ENABLE;
		
    drv_can.device.config = config;
    /* register CAN2 device */
    rt_hw_can_register(&drv_can.device, drv_can.name, &canops, &drv_can);
#endif /* BSP_USING_CAN2 */
#endif

    return 0;
}

INIT_BOARD_EXPORT(rt_hw_can_init);

#endif /* defined(BSP_USING_CAN1) || defined(BSP_USING_CAN2) */
#endif /*RT_USING_CAN*/
